#language: zh-CN
功能: 财务报表
  以便于财务预测

  场景: CRUD财报

  场景大纲: 拉预测
    假设当前月为'201907'
    假设'张三'开了户
    并且月收入:
      | 项目  | 数额       | 月周期 | 开始月份   |
      | 工资  | <salary> | 1   | 201908 |
      | 公积金 | <fund>   | 3   | 201908 |
    并且月支出:
      | 项目  | 数额         | 月周期 | 开始月份   |
      | 水电网 | <expenses> | 1   | 201908 |
      | 吃   | <food>     | 1   | 201908 |
    并且当前存款为<cash>
    当拉2个月的预测
    那么生成预测:
      | 月  | 余额  |
      | 07 | <7> |
      | 08 | <8> |
      | 09 | <9> |

    例子:
      | cash  | salary | fund | expenses | food | 7     | 8     | 9     |
      | 0     | 1      | 0    | 0        | 0    | 0     | 1     | 2     |
      | 0     | 1      | 0    | 1        | 0    | 0     | 0     | 0     |
      | 0     | 0      | 1    | 0        | 0    | 0     | 1     | 1     |
      | 50000 | 22001  | 6000 | 1000     | 3000 | 50000 | 74001 | 92002 |